<?php

defined('POPLR') or die();

return array(
	'app.layout.subtitle' => 'Олдскульный <nobr>3d&ndash;шутер</nobr><br />с мультяшной графикой<br />от создателей Gloomy Dungeons',
	'app.layout.privacy' => 'Конфиденциальность',
	'app.layout.licenses' => 'Лицензии',

    'app.index.content' => '
<p>Fire Strike Retro – это олдскульный 3d–шутер с мультяшной графикой от создателей Gloomy Dungeons.</p>
<p>Изначально у нас была идея взять движок от Gloomy Dungeons 2, вставить в него прикольную мультяшную графику (вместо 8-битной), немного подправить уровни, и вперёд и с песней. Но в процессе переделок стало ясно, что по–быстрому не получится :)</p>
<ul>
	<li>Мы полностью переделали обучение. Надеемся, что оно не покажется слишком сложным и непонятным для новичков, и, с другой стороны, не будет слишком унылым для бывалых игроков в 3D–шутеры.</li>
	<li>Полностью поменялся механизм взаимодействия с миникартой. Вместо того чтобы включать и выключать её (как в оригинальных глуми), она теперь видна всегда. Кроме того, на ней сразу видно куда нужно идти (вместо стрелочек на полу, как было раньше), так что вы не потеряетесь в бесконечных лабиринтах.</li>
	<li>Игра была основательно перебалансирована (стыдно признавать, но раньше мы это делали на глазок). Хорошо получилось или нет - решать вам, но на наш вкус играть стало гораздо веселей.</li>
	<li>Сделали возможность быстрой смены оружия (вместо того, чтоб постоянно заходить в меню). Нам кажется, что это удобная фича, особенно на последних уровнях, чтобы быстро переключаться между гранатами и винчестером.</li>
	<li>И наконец, основная фишка, отличающая эту игру от наших предыдущих – использование процедурной генерации как базы для создания уровней. Конечно же, мы не стали вставлять сгенерированные уровни как есть – каждый из них был с любовью подправлен руками. Но тем не менее, именно процедурная генерация задала основную структуру и "ритм" уровня. Возможно, из-за неё на некоторых уровнях придётся побегать туда–сюда, но это тоже, на наш взгляд, "добавляет".</li>
</ul>
<p>По сравнению с глуми, эта игруха получилась гораздо более динамичной. Больше никаких скучных отстрелов монстров – только хардкор! Так что, если вам нравятся 3D шутеры от первого лица, дайте этой игре шанс :)</p>
<p>И кратко по остальным фичам:</p>
<ul>
	<li>35 уровней.</li>
	<li>7 видов оружия.</li>
	<li>Более 5000 врагов.</li>
	<li>Около 5 часов игры.</li>
	<li>24 достижения.</li>
	<li>В каждом уровне есть секрет (иногда и не один).</li>
</ul>
<p>Повеселитесь там!</p>
    ',

	'app.help.howToPlay' => 'Как играть',
	'app.help.howToPlayContent' => '
<h3><span>Главное меню</h3></span>
<p>
	После нажатия на кнопку <strong>Играть</strong>, вы увидете карту, на которой будет показан пройденный путь. Нажмите на кнопку <strong>Продолжить</strong> или на карту, для продолжения игры.
</p>
<p>
	Нажмите на <strong>Настройки</strong> чтобы настроить звук и управление. Нажмите на <strong>Достижения</strong> чтобы просмотреть доступные ачивки.
</p>
	',
	'app.help.controls' => 'Управление',
	'app.help.controlsContent' => '
<p>
	В <strong>левом нижнем</strong> углу находится наэкранный джойстик, с помощью которого вы можете передвигаться вперёд, назад, влево и вправо. В <strong>правом нижнем</strong> углу &mdash; кнопка стрельбы.
</p>
<p>
	Всю <strong>правую сторону</strong> экрана можно использовать для поворотов &mdash; для этого надо опустить палец на экран и двигать им влево / вправо. Если изначально опустить палец на кнопку стрельбы, то можно одновременно стрелять и поворачиваться.
</p>
<p>
	В <strong>левом верхнем</strong> углу &mdash; кнопка игрового меню. В нём вы сможете сменить оружие, ввести игровой код или выйти в главное меню. Под ней находятся индикаторы энергии (здоровья), брони и патронов. Рядом с ними будут появлятся индикаторы взятых ключей.
</p>
<p>
	В <strong>правом верхнем</strong> углу находится миникарта. На ней обозначены посещённые вами места и указатели направления движения.
</p>
	',
	'app.help.options' => 'Настройки',
	'app.help.optionsContent' => '
<h3><span>Общие</span></h3>
<p>
	<strong>Язый</strong> &mdash; сменить язык внутри игры
</p>
<p>
	<strong>Помощь</strong> &mdash; открыть помощь по игре.
</p>
<p>
	<strong>Об игре и лицензиях</strong> &mdash; информация об авторах и лицензиях для свободного программного обеспечения, используемое в игре.
</p>
<p>
	<strong>Начать игру с самого начала</strong> &mdash; если, по каким&ndash;либо причинам, вам захочется начать всё сначала. Весь прогресс и все достижения будут сброшены. Это не шутка!
</p>
<h3><span>Звук</span></h3>
<p>
	<strong>Включить звук</strong> &mdash; если вы играете ночью, выключите звук, чтобы не пугать соседей :)
</p>
<p>
	<strong>Громкость музыки</strong> &mdash; громкость фоновой музыки.
</p>
<p>
	<strong>Громкость эффектов</strong> &mdash; громкость выстрелов и прочих звуков.
</p>
<h3><span>Управление</span></h3>
<p>
	<strong>Тип управления</strong> &mdash; здесь вы можете поменять тип управления, если вас не устраивает текущий.
</p>
<p>
	<strong>Настройка управления</strong> &mdash; хотя мы изначально подобрали самые оптимальные параметры, вы можете захотеть настроить их под себя.
</p>
<p>
	<strong>Переназначение кнопок</strong> &mdash; если в вашем телефоне либо планшете есть аппаратные кнопки, то тут вы можете их переназначить.
</p>
<h3><span>Экран</span></h3>
<p>
	<strong>Яркость</strong> &mdash; если даже на максимальной яркости экрана изображение слишком тёмное, тут вы можете это исправить.
</p>
<p>
	<strong>Показывать прицел</strong> &mdash; хотя, следуя канонам Doom&ndash;а, точно прицеливаться вам не придётся, вы всё равно можете включить прицел.
</p>
<p>
	<strong>Повернуть игровой экран</strong> &mdash; развернуть экран на 180 градусов. Полезно, если на вашем телефоне есть аппаратные кнопки (D&ndash;Pad или трекбол)
            и вы хотите играть левой рукой.
</p>
<h3><span>Аналитика и реклама</span></h3>
<p>
	<strong>Персонализированная реклама</strong> &mdash; Fire Strike персонализирует вашу рекламу с помощью Appodeal. Appodeal и ее партнеры могут собирать и обрабатывать персональные данные, такие как идентификаторы устройств, данные о местоположении и другие демографические данные и данные о ваших интересах, чтобы обеспечить рекламный опыт, адаптированный для вас. Соглашаясь на это, вы увидите рекламу, которую Appodeal и ее партнеры считают более релевантной для вас. Соглашаясь, вы подтверждаете, что вам исполнилось 16 лет, и вы хотели бы видеть персонализированную рекламу. Узнать больше можно по ссылке <a href="https://www.appodeal.com/privacy-policy" target="_blank">https://www.appodeal.com/privacy-policy</a>. Если вы не согласны, Appodeal не будет собирать ваши данные для персонализированной рекламы в этом приложении. Однако вы по прежнему будете видеть рекламу, но она может не соответствовать вашим интересам.
</p>
<p>
	<strong>Отсылать внутриигровую аналитику</strong> &mdash; мы будем использовать эти анонимные данные для улучшения этой и других наших игр.
</p>
<h3><span>Настройка управления</span></h3>
<p>
	<strong>Скорость ходьбы</strong> &mdash; настройка скорости движения (вперёд/назад).
</p>
<p>
	<strong>Скорость стрейфа</strong> &mdash; настройка скорости шагов (влево/вправо).
</p>
<p>
	<strong>Скорость поворота</strong> &mdash; настройка скорости поворотов (по сторонам).
</p>
<p>
	<strong>Инвертировать вращение по вертикали</strong> &mdash; выберете для инвертирования вертикального вращения.
</p>
<p>
	<strong>Инвертировать вращение по горизонтали</strong> &mdash; выберете для инвертирования горизонтального вращения (поворотов).
</p>
<p>
	<strong>Кнопка стрельбы слева</strong> &mdash; разместить кнопку стрельбы слева (а наэкранный джойстик справа).
</p>
<p>
	<strong>Кнопка стрельбы сверху</strong> &mdash; разместить кнопку стрельбы сверху (полезно, если есть проблемы с мультитачем).
</p>
<p>
	<strong>Размер иконок управления</strong> &mdash; настройка размера иконок наэкранного управления.
</p>
<p>
	<strong>Прозрачность иконок управления</strong> &mdash; прозрачность наэкранного управления, от почти невидимого до полностью непрозрачного.
</p>
<p>
	<strong>Использовать акселерометр</strong> &mdash; выберете для поворотов с помощью акселерометра.
</p>
<p>
	<strong>Ускорение акселеромерта</strong> &mdash; как быстро игрок будет поворачиваться при использовании акселерометра.
</p>
<p>
	<strong>Ускорение трекбола</strong> &mdash; как быстро игрок будет передвигаться при управлении с помощью трекбола (если он есть в вашем телефоне).
</p>
	',

	'app.dislike.title' => 'Не нравится? Скажите нам почему',
	'app.dislike.placeholder' => 'Скажите нам, как мы можем улучшить игру',
	'app.dislike.send' => 'Нажмите здесь, чтобы отправить отзыв',
	'app.dislike.thankYou' => 'Спасибо за ваш отзыв',

	'app.privacy.title' => 'Политика конфиденциальности',
	'app.privacy.eightSines' => 'Политика конфиденциальности EightSines Studio',
	'app.privacy.eightSinesContent' => '
Мы собираем анонимизированные данные о вашем игровом прогрессе и достижениях. Так же, мы надеемся что этого не произойдёт, но если, вдруг, игра упадёт, то мы соберём анонимизированную информацию о падении, которая может включать модель устройства и его производителя.
	',
	'app.privacy.thirdParty' => 'Сторонние библиотеки',

	'app.licenses.title' => 'Лицензии',
);
